app/views/users/show.html.erb


  <% @user.reservations.each do |f| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = 1