app/views/restaurants/_restaurantform.html.erb

    <%= f.label "category" %>
    <%= f.collection_select :category_id, Category.all, :id, :food_type %>
---
SELECT "categories".* FROM "categories"