app/controllers/reservations_controller.rb

  def create
    # raise params[:reservation].inspect
    # @reservation = Reservation.new(
    #    time: params[:reservation][:time],
    #    size: params[:reservation][:size],
    #    restaurant_id: params[:restaurant_id],
    #    user_id: current_user.id)
    @reservation = @restaurant.reservations.build(params[:reservation])
    @reservation.user = current_user
    # raise @reservation.inspect


    if @reservation.save
---
INSERT INTO "reservations" ("created_at", "restaurant_id", "size", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

    def load_restaurant
          @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "4"]]