app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "points", "remember_token", "role", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    @user.points = 0
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "role" = 'admin', "password_digest" = '$2a$10$fpht2.H6rhaN2n.a//PdguOYjFJ9YC9vKCgJXDLKxPl.d0Wt9urKS', "updated_at" = '2013-07-15 20:40:44.338764' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])